# Создайте несколько переменных разных типов. 
# Проверьте, к какому типу относятся созданные переменные

a = 5
print(type(a))
a = "Hello, world!"
print(type(a))
a = 3.6097431
print(type(a))
